Network Working Group                                    H. Long, M. Ye 
Internet Draft                             Huawei Technologies Co., Ltd         
Intended status: Standards Track                              G. Mirsky  
                                                                    ZTE 
                                                         A.D'Alessandro 
                                                   Telecom Italia S.p.A 
                                                                H. Shah 
                                                                  Ciena         
Expires: September 2019                                   March 6, 2019  
 
                                      
         Ethernet Traffic Parameters with Availability Information  
           draft-ietf-ccamp-rsvp-te-bandwidth-availability-14.txt 


Abstract 

   A packet switching network may contain links with variable 
   bandwidth, e.g., copper, radio, etc. The bandwidth of such links is 
   sensitive to external environment (e.g., climate). Availability is 
   typically used for describing these links when doing network 
   planning. This document introduces an optional Availability TLV in 
   Resource ReSerVation Protocol - Traffic Engineer (RSVP-TE) 
   signaling. This extension can be used to set up a Generalized Multi-
   Protocol Label Switching (GMPLS) Label Switched Path (LSP) in 
   conjunction with the Ethernet SENDER_TSPEC object. 

Status of this Memo 

   This Internet-Draft is submitted in full conformance with the 
   provisions of BCP 78 and BCP 79.  

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups.  Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six 
   months and may be updated, replaced, or obsoleted by other documents 
   at any time.  It is inappropriate to use Internet-Drafts as 
   reference material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at 
   http://www.ietf.org/ietf/1id-abstracts.txt 

   The list of Internet-Draft Shadow Directories can be accessed at 
   http://www.ietf.org/shadow.html 

 
 
 
Long, et al.          Expires September 6, 2019               [Page 1] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

   This Internet-Draft will expire on September 6, 2019. 

Copyright Notice 

   Copyright (c) 2019 IETF Trust and the persons identified as the 
   document authors. All rights reserved. 

   This document is subject to BCP 78 and the IETF Trust's Legal 
   Provisions Relating to IETF Documents 
   (http://trustee.ietf.org/license-info) in effect on the date of 
   publication of this document. Please review these documents 
   carefully, as they describe your rights and restrictions with 
   respect to this document. Code Components extracted from this 
   document must include Simplified BSD License text as described in 
   Section 4.e of the Trust Legal Provisions and are provided without 
   warranty as described in the Simplified BSD License. 

Table of Contents 

   1. Introduction ................................................ 3 
   2. Overview .................................................... 4 
   3. Extension to RSVP-TE Signaling............................... 5 
      3.1. Availability TLV........................................ 5 
      3.2. Signaling Process....................................... 6 
   4. Security Considerations...................................... 7 
   5. IANA Considerations ......................................... 7 
      5.1  Ethernet Sender TSpec TLVs ............................. 7 
   6. References .................................................. 8 
      6.1. Normative References.................................... 8 
      6.2. Informative References.................................. 8 
   7. Appendix: Bandwidth Availability Example..................... 9 
   8. Acknowledgments ............................................ 10 
 
Conventions used in this document 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and 
   "OPTIONAL" in this document are to be interpreted as described in 
   BCP 14 [RFC2119] [RFC8174] when, and only when, they appear in all 
   capitals, as shown here. 

   The following acronyms are used in this draft: 

   RSVP-TE  Resource Reservation Protocol-Traffic Engineering 

   LSP      Label Switched Path 

 
 
Long, et al.          Expires September 6, 2019               [Page 2] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

   SNR      Signal-to-noise Ratio 

   TLV      Type Length Value 

   LSA      Link State Advertisement 

1. Introduction 

   The RSVP-TE specification [RFC3209] and GMPLS extensions [RFC3473] 
   specify the signaling message including the bandwidth request for 
   setting up a Label Switched Path in a packet switching network. 

   Some data communication technologies allow seamless change of 
   maximum physical bandwidth through a set of known discrete values. 
   The parameter availability [G.827], [F.1703], [P.530] is often used 
   to describe the link capacity during network planning. The 
   availability is based on a time scale, which is a proportion of the 
   operating time that the requested bandwidth is ensured. A more 
   detailed example on the bandwidth availability can be found in 
   Appendix A. Assigning different bandwidth availability classes to 
   different types of services over such kind of links provides for a 
   more efficient planning of link capacity. To set up an LSP across 
   these links, bandwidth availability information is required for the 
   nodes to verify bandwidth satisfaction and make bandwidth 
   reservation. The bandwidth availability information should be 
   inherited from the bandwidth availability requirements of the 
   services expected to be carried on the LSP. For example, voice 
   service usually needs "five nines" bandwidth availability, while 
   non-real time services may adequately perform at four or three nines 
   bandwidth availability. Since different service types may need 
   different availabilities guarantees, multiple <availability, 
   bandwidth> pairs may be required when signaling.  

   If the bandwidth availability requirement is not specified in the 
   signaling message, the bandwidth will be reserved as the highest 
   bandwidth availability. Suppose, for example, the bandwidth with 
   99.999% availability of a link is 100 Mbps; the bandwidth with 
   99.99% availability is 200 Mbps. When a video application requests 
   for 120 Mbps without bandwidth availability requirement, the system 
   will consider the request as 120 Mbps with 99.999% bandwidth 
   availability, while the available bandwidth with 99.999% bandwidth 
   availability is only 100 Mbps, therefore the LSP path cannot be set 
   up. But, in fact, the video application doesn't need 99.999% 
   bandwidth availability; 99.99% bandwidth availability is enough. In 
   this case, the LSP could be set up if bandwidth availability is also 
   specified in the signaling message.    

 
 
Long, et al.          Expires September 6, 2019               [Page 3] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

   To fulfill LSP setup by signaling in these scenarios, this document 
   specifies an Availability TLV. The Availability TLV can be 
   applicable to any kind of physical links with variable discrete 
   bandwidth, such as microwave or DSL. Multiple Availability TLVs 
   together with multiple Ethernet Bandwidth Profiles can be carried by 
   the Ethernet SENDER_TSPEC object [RFC6003]. Since the Ethernet 
   FLOWSPEC object has the same format as the Ethernet SENDER_TSPEC 
   object [RFC6003], the Availability TLV can also be carried by the 
   Ethernet FLOWSPEC object.  

2. Overview 

   A tunnel in a packet switching network may span one or more links in 
   a network. To setup a Label Switched Path (LSP), a node may collect 
   link information which is advertised in a routing message, e.g., 
   OSPF TE LSA message, by network nodes to obtain network topology 
   information, and then calculate an LSP route based on the network 
   topology. The calculated LSP route is signaled using a PATH/RESV 
   message for setting up the LSP. 

   In case that there is (are) link(s) with variable discrete bandwidth 
   in a network, a <bandwidth, availability> requirement list should be 
   specified for an LSP at setup. Each <bandwidth, availability> pair 
   in the list means the listed bandwidth with specified availability 
   is required. The list could be derived from the results of service 
   planning for the LSP.  

   A node which has link(s) with variable discrete bandwidth attached 
   should contain a <bandwidth, availability> information list in its 
   OSPF TE LSA messages. The list provides the mapping between the link 
   nominal bandwidth and its availability level. This information can 
   then be used for path calculation by the node(s). The routing 
   extension for availability can be found in [RFC8330]. 

   When a node initiates a PATH/RESV signaling to set up an LSP, the 
   PATH message should carry the <bandwidth, availability> requirement 
   list as a bandwidth request.  Intermediate node(s) will allocate the 
   bandwidth resource for each availability requirement from the 
   remaining bandwidth with corresponding availability. An error 
   message may be returned if any <bandwidth, availability> request 
   cannot be satisfied. 






 
 
Long, et al.          Expires September 6, 2019               [Page 4] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

3. Extension to RSVP-TE Signaling 

3.1. Availability TLV 

   An Availability TLV is defined as a TLV of the Ethernet SENDER_TSPEC 
   object [RFC6003] in this document. The Ethernet SENDER_TSPEC object 
   MAY include more than one Availability TLV. The Availability TLV has 
   the following format: 

       0                   1                   2                   3 
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |               Type            |              Length           | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |    Index      |                 Reserved                      | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
      |                          Availability                         | 
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 

                          Figure 1: Availability TLV 

      Type (2 octets): 0x04 

      Length (2 octets): 0x0C. Indicates the length in bytes of the 
      whole TLV including the Type and Length fields, in this case 12 
      bytes.  

      Index (1 octet):  

      When the Availability TLV is included, it MUST be present along 
      with the Ethernet Bandwidth Profile TLV. If the bandwidth 
      requirements in the multiple Ethernet Bandwidth Profile TLVs have 
      different Availability requirements, multiple Availability TLVs 
      SHOULD be carried. In such a case, the Availability TLV has a one 
      to one correspondence with the Ethernet Bandwidth Profile TLV by 
      having the same value of Index field. If all the bandwidth 
      requirements in the Ethernet Bandwidth Profile have the same 
      Availability requirement, one Availability TLV SHOULD be carried. 
      In this case, the Index field is set to 0. 

      Reserved (3 octets): These bits SHOULD be set to zero when sent 
      and MUST be ignored when received.  

      Availability (4 octets): a 32-bit floating point number describes 
      the decimal value of availability requirement for this bandwidth 
      request. The value MUST be less than 1and is usually expressed in 
      the value of 0.99/0.999/0.9999/0.99999. 
 
 
Long, et al.          Expires September 6, 2019               [Page 5] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

3.2. Signaling Process 

   The source node initiates a PATH message which may carry a number of 
   bandwidth requests, including one or more Ethernet Bandwidth Profile 
   TLVs and one or more Availability TLVs. Each Ethernet Bandwidth 
   Profile TLV corresponds to an availability parameter in the 
   associated Availability TLV. 

   The intermediate and destination nodes check whether they can 
   satisfy the bandwidth requirements by comparing each bandwidth 
   request inside the SENDER_TSPEC objects with the remaining link sub-
   bandwidth resource with respective availability guarantee on the 
   local link when the PATH message is received.  

     o   When all <bandwidth, availability> requirement requests can 
        be satisfied (the requested bandwidth under each availability 
        parameter is smaller than or equal to the remaining bandwidth 
        under the corresponding availability parameter on its local 
        link), the node SHOULD reserve the bandwidth resource from each 
        remaining sub-bandwidth portion on its local link to set up 
        this LSP. Optionally, a higher availability bandwidth can be 
        allocated to lower availability request when the lower 
        availability bandwidth cannot satisfy the request. 

     o   When at least one <bandwidth, availability> requirement 
        request cannot be satisfied, the node SHOULD generate PathErr 
        message with the error code "Admission Control Error" and the 
        error value "Requested Bandwidth Unavailable" (see [RFC2205]). 

   When two LSPs request bandwidth with the same availability 
   requirement, contention MUST be resolved by comparing the node IDs, 
   with the LSP with the higher node ID being assigned the reservation. 
   This is consistent with general contention resolution mechanism 
   provided in section 3.2 of [RFC3473]. 

   When a node does not support the Availability TLV, the node SHOULD 
   generate a PathErr message with the error code "Extended Class-Type 
   Error" and the error value "Class-Type mismatch" (see [RFC2205]). 
   When a node receives Availability TLVs which mixed of zero index and 
   non-zero index, the message MAY be ignored and SHOULD NOT be 
   propagated. When a node receives Availability TLVs (non-zero index) 
   with no matching index value among the bandwidth-TLVs, the message 
   MAY be ignored and SHOULD NOT be propagated. When a node receives 
   several <bandwidth, availability> pairs, but there're are extra 
   bandwidth-TLVs without matching index Availability-TLV, the extra 
   bandwidth-TLVs MAY be ignored and SHOULD NOT be propagated.    

 
 
Long, et al.          Expires September 6, 2019               [Page 6] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

4. Security Considerations 

   This document defines an Availability TLV in RSVP-TE signaling used 
   in GMPLS network. [RFC3945] notes that authentication in GMPLS 
   systems may use the authentication mechanisms of the component 
   protocols. [RFC5920] provides an overview of security 
   vulnerabilities and protection mechanisms for the GMPLS control 
   plane. Especially section 7.1.2 of [RFC5920] discuss the control-
   plane protection with RSVP-TE by using general RSVP security tools, 
   limiting the impact of an attack on control-plane resources, and 
   authentication for RSVP messages. Moreover, the GMPLS network is 
   often considered to be a closed network such that insertion, 
   modification, or inspection of packets by an outside party is not 
   possible. 

5. IANA Considerations 

   IANA maintains registries and sub-registries for RSVP-TE used by 
   GMPLS. IANA is requested to make allocations from these registries 
   as set out in the following sections.  

5.1 Ethernet Sender TSpec TLVs  

   IANA maintains a registry of GMPLS parameters called "Generalized 
   Multi-Protocol Label Switching (GMPLS) Signaling Parameters". 

   IANA has created a sub-registry called "Ethernet Sender TSpec TLVs / 
   Ethernet Flowspec TLVs" to contain the TLV type values for TLVs 
   carried in the Ethernet SENDER_TSPEC object. The sub-registry needs 
   to be updated to include the Availability TLV which is defined as 
   follow. This document proposes a suggested value for the 
   Availability sub-TLV; it is requested that the suggested value be 
   granted by IANA. 

    

   Type       Description                            Reference 

   -----      -----------------------------------    --------- 

   0x04        Availability                           [This ID]          

   The registration procedure for this registry is Standards Action as 
   defined in [RFC8126]. 



 
 
Long, et al.          Expires September 6, 2019               [Page 7] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

6. References 

6.1. Normative References 

   [RFC2205] Braden, R., Ed., Zhang, L., Berson, S., Herzog, S., and 
             S.Jamin, "Resource ReSerVation Protocol (RSVP) - Version 1 
             Functional Specification", RFC 2205, September 1997. 

   [RFC3209] Awduche, D., Berger, L., Gan, D., Li, T., Srinivasan, 
             V.,and G. Swallow, "RSVP-TE: Extensions to RSVP for LSP 
             Tunnels", RFC 3209, December 2001. 

   [RFC3473] Berger, L., "Generalized Multi-Protocol Label Switching            
             (GMPLS) Signaling Resource ReserVation Protocol-Traffic            
             Engineering (RSVP-TE) Extensions", RFC 3473, January 2003. 

   [RFC6003] Papadimitriou, D. "Ethernet Traffic Parameters", RFC 6003, 
             October 2010. 

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC 
             2119 Key Words", BCP 14, RFC 8174, May 2017. 

6.2. Informative References 

   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", RFC 2119, March 1997. 

   [RFC8126] Cotton,M. and Leiba,B., and Narten T., "Guidelines for 
             Writing an IANA Considerations Section in RFCs", RFC 8126, 
             June 2017. 

   [RFC3945] Mannie, E., "Generalized Multi-Protocol Label Switching 
             (GMPLS) Architecture", RFC 3945, October 2004. 

   [RFC5920] Fang, L., "Security Framework for MPLS and GMPLS 
             Networks", RFC 5920, July 2010. 

   [G.827]  ITU-T Recommendation, "Availability performance parameters 
             and objectives for end-to-end international constant bit-
             rate digital paths", September 2003. 

   [F.1703]  ITU-R Recommendation, "Availability objectives for real 
             digital fixed wireless links used in 27 500 km 
             hypothetical reference paths and connections", January 
             2005. 


 
 
Long, et al.          Expires September 6, 2019               [Page 8] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

   [P.530]   ITU-R Recommendation," Propagation data and prediction 
             methods required for the design of terrestrial line-of-
             sight systems", February 2012 

   [EN 302 217] ETSI standard, "Fixed Radio Systems; Characteristics 
             and requirements for point-to-point equipment and 
             antennas", April 2009 

   [RFC8330] H., Long, M., Ye, Mirsky, G., Alessandro, A., Shah, H., 
             "OSPF Traffic Engineering (OSPF-TE) Link Availability 
             Extension for Links with Variable Discrete Bandwidth", 
             RFC8330, February 2018 

7. Appendix: Bandwidth Availability Example 

   In a mobile backhaul network, microwave links are very popular for 
   providing connections of last hops. In case of heavy rain 
   conditions, to maintain the link connectivity, the microwave link 
   MAY lower the modulation level since demodulating to a lower 
   modulation level provides for a lower Signal-to-Noise Ratio (SNR) 
   requirement. This is called adaptive modulation technology [EN 302 
   217]. However, a lower modulation level also means lower link 
   bandwidth. When link bandwidth is reduced because of modulation 
   down-shifting, high-priority traffic can be maintained, while lower-
   priority traffic is dropped. Similarly, copper links may change 
   their link bandwidth due to external interference. 

   Presuming that a link has three discrete bandwidth levels:  

   The link bandwidth under modulation level 1, e.g., QPSK, is 100 
   Mbps; 

   The link bandwidth under modulation level 2, e.g., 16QAM, is 200 
   Mbps; 

   The link bandwidth under modulation level 3, e.g., 256QAM, is 400 
   Mbps. 

   On a sunny day, the modulation level 3 can be used to achieve 400 
   Mbps link bandwidth. 

   A light rain with X mm/h rate triggers the system to change the 
   modulation level from level 3 to level 2, with bandwidth changing 
   from 400 Mbps to 200 Mbps. The probability of X mm/h rain in the 
   local area is 52 minutes in a year. Then the dropped 200 Mbps 
   bandwidth has 99.99% availability. 

 
 
Long, et al.          Expires September 6, 2019               [Page 9] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

   A heavy rain with Y(Y>X) mm/h rate triggers the system to change the 
   modulation level from level 2 to level 1, with bandwidth changing 
   from 200 Mbps to 100 Mbps. The probability of Y mm/h rain in the 
   local area is 26 minutes in a year. Then the dropped 100 Mbps 
   bandwidth has 99.995% availability. 

   For the 100M bandwidth of the modulation level 1, only the extreme 
   weather condition can cause the whole system to be unavailable, 
   which only happens for 5 minutes in a year. So the 100 Mbps 
   bandwidth of the modulation level 1 owns the availability of 
   99.999%. 

   Therefore, the maximum bandwidth is 400 Mbps. According to the 
   weather condition, the sub-bandwidth and its availability are shown 
   as follows: 

   Sub-bandwidth (Mbps)   Availability                       

   ------------------     ------------          

   200                    99.99%                 

   100                    99.995%                

   100                    99.999%                

8. Acknowledgments 

   The authors would like to thank Deborah Brungard, Khuzema Pithewan, 
   Lou Berger, Yuji Tochio, Dieter Beller, and Autumn Liu for their 
   comments and contributions on the document. 

    

    

    

   Authors' Addresses 







 
 
Long, et al.          Expires September 6, 2019              [Page 10] 

Internet-Draft    Availability extension to RSVP-TE         March 2019 
    

   Hao Long 
   Huawei Technologies Co., Ltd. 
   No.1899, Xiyuan Avenue, Hi-tech Western District 
   Chengdu 611731, P.R.China 
    
   Phone: +86-18615778750 
   Email: longhao@huawei.com 
    
    
   Min Ye (editor) 
   Huawei Technologies Co., Ltd. 
   No.1899, Xiyuan Avenue, Hi-tech Western District 
   Chengdu 611731, P.R.China 
 
   Email: amy.yemin@huawei.com 
    
   Greg Mirsky (editor) 
   ZTE 
    
   Email: gregimirsky@gmail.com 
    
   Alessandro D'Alessandro 
   Telecom Italia S.p.A 
    
   Email: alessandro.dalessandro@telecomitalia.it 
    
    
   Himanshu Shah 
   Ciena Corp. 
   3939 North First Street 
   San Jose, CA 95134 
   US 
    
   Email: hshah@ciena.com 
    

 









 
 
Long, et al.          Expires September 6, 2019              [Page 11] 

